src/cf/Documents/уатСчетНаОплатуПокупателю.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>уатСчетНаОплатуПокупателю</Name>
			<BasedOn>
				<xr:Item>Document.уатРеализацияУслуг</xr:Item>
				<xr:Item>Document.уатТТД</xr:Item>
				<xr:Item>Document.уатЗаказГрузоотправителя</xr:Item>
				<xr:Item>Document.уатМаршрутныйЛист</xr:Item>
				<xr:Item>Document.уатРеестрПеревозок</xr:Item>
			</BasedOn>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантПечатиQRКода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатВариантыПечатиQRКода</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКон</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКурса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНач</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтгрузки</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправкиСД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПлатежноРасчетногоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ, на основании которого введен данный</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.уатРеализацияУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.уатМаршрутныйЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
						<v8:Type>cfg:DocumentRef.уатТТД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактноеЛицо</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьВзаиморасчетов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсВзаиморасчетов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПлатежноРасчетногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СверткаУслугРегл</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВключаетНДС</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Comment>(Общ) Сумма в валюте документа, налоги включены согласно флагам</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьНДС</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтапОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатЭтапыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
					<Comment>(Общ)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.уатЗаказГрузоотправителя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>22</v8:Digits>
									<v8:FractionDigits>10</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Содержание</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяДоходов</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.уатСтатьиДоходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КроссКурс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>16</v8:Digits>
									<v8:FractionDigits>10</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаВалютная</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВалютная</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДСвалютная</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УслугиРегл</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>22</v8:Digits>
									<v8:FractionDigits>10</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Содержание</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяДоходов</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.уатСтатьиДоходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УдалитьДополнительныеРеквизиты</Name>
					<Comment>Удалено в 1.1.10.1 из-за расхождения идентификаторов в Стд и Корп</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Documents/уатСчетНаОплатуПокупателю/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
	Настройки.ПриПолученииСлужебныхРеквизитов = Ложь;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.уатСчетНаОплатуПокупателю";
	КомандаПечати.Идентификатор  = "СчетНаОплатуПокупателю";
	КомандаПечати.Представление  = НСтр("en='Invoice to buyer';ru='Счет на оплату покупателю'");
	КомандаПечати.Порядок        = 1;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.уатСчетНаОплатуПокупателю";
	КомандаПечати.Идентификатор = "СчетНаОплатуПокупателюФаксимиле";
	КомандаПечати.Представление = НСтр("en='Invoice to buyer';ru='Счет на оплату покупателю (факсимиле)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок         = 2;
	
	// Реестр документов
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор  = "Реестр";
	КомандаПечати.Представление  = НСтр("en='Document register';ru='Реестр документов'");
	КомандаПечати.ЗаголовокФормы = НСтр("en='Register of documents ""Invoice to buyer""';ru='Реестр документов ""Счет на оплату покупателю""'");
	КомандаПечати.Обработчик     = "уатОбщегоНазначенияТиповыеКлиент.ВыполнитьКомандуПечатиРеестраДокументов";
	КомандаПечати.СписокФорм     = "ФормаСписка";
	КомандаПечати.Порядок        = 100;
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр).
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной
//                                                            параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной
//                                            параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПредварительныйПросмотрПечатнойФормыСчетНаОплату") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПредварительныйПросмотрПечатнойФормыСчетНаОплату",
			"Счет на оплату покупателю", ПечатьПредварительныйПросмотрСчетаНаОплату(ПараметрыПечати.Подпись, ОбъектыПечати, "СчетЗаказ"));
	КонецЕсли;

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СчетНаОплатуПокупателю") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СчетНаОплатуПокупателю",
			"Счет на оплату покупателю", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати));
			
	ИначеЕсли УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СчетНаОплатуПокупателюФаксимиле") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СчетНаОплатуПокупателюФаксимиле",
			"Счет на оплату покупателю", ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, Истина));
			
	КонецЕсли;
		
	уатОбщегоНазначенияСервер.УстановитьРедактированиеПечатныхФормДокумента(КоллекцияПечатныхФорм); 
	уатУправлениеПечатью.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов, КоллекцияПечатныхФорм);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

// СтандартныеПодсистемы.УправлениеДоступом

// Позволяет переопределить ограничение, указанное в модуле менеджера объекта метаданных.
//
// Параметры:
//  Ограничение - Структура:
//    * Текст                             - Строка - ограничение доступа для пользователей.
//                                          Если пустая строка, значит, доступ разрешен.
//    * ТекстДляВнешнихПользователей      - Строка - ограничение доступа для внешних пользователей.
//                                          Если пустая строка, значит, доступ запрещен.
//    * ПоВладельцуБезЗаписиКлючейДоступа - Неопределено - определить автоматически.
//                                        - Булево - если Ложь, то всегда записывать ключи доступа,
//                                          если Истина, тогда не записывать ключи доступа,
//                                          а использовать ключи доступа владельца (требуется,
//                                          чтобы ограничение было строго по объекту-владельцу).
//   * ПоВладельцуБезЗаписиКлючейДоступаДляВнешнихПользователей - Неопределено, Булево - также
//                                          как у параметра ПоВладельцуБезЗаписиКлючейДоступа.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(Ответственный)";
	
	// Для внешних пользователей не используется ограничение по ответственным,
	// т.к. ограничение доступа по пользователям предназначено только для обычных, не внешних, пользователей
	Ограничение.ТекстДляВнешнихПользователей = "РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// СтандартныеПодсистемы.ВариантыОтчетов

// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

#КонецОбласти

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьДополнительныеРеквизитыДляРеестра() Экспорт
	
	Результат = Новый Структура("Информация", "Контрагент");
	Возврат Результат;
	
КонецФункции

Процедура ВыполнитьКонтроль(ДокументСсылка, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь) Экспорт
	
	Заглушка = Истина;
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Функция ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, Факсимиле = Ложь)
	Перем Ошибки;
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_СчетНаОплатуПокупателюФаксимиле";
	
	Тип = "Счет";
	
	ПервыйДокумент = Истина;
	
	Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СчетНаОплатуПокупателю_СчетНаОплатуПокупателю";
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.уатСчетНаОплатуПокупателю.ПФ_MXL_СчетНаОплатуПокупателю");
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент.Ссылка);
		Запрос.Текст ="
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Номер,
		|	Дата,
		|	ДоговорКонтрагента,
		|	Организация,
		|	Контрагент КАК Получатель,
		|	Организация КАК Руководители,
		|	Организация КАК Поставщик,
		|	СуммаДокумента,
		|	ВалютаДокумента,
		|	УчитыватьНДС,
		|	СуммаВключаетНДС
		|ИЗ
		|	Документ.уатСчетНаОплатуПокупателю КАК СчетНаОплатуПокупателю
		|
		|ГДЕ
		|	СчетНаОплатуПокупателю.Ссылка = &ТекущийДокумент";
		
		Шапка = Запрос.Выполнить().Выбрать();
		Шапка.Следующий();
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ТекущийДокумент", ТекущийДокумент.Ссылка);
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетНаОплату.Номенклатура,
		|	ВЫБОР
		|		КОГДА СчетНаОплату.Содержание ЕСТЬ NULL 
		|				ИЛИ ВЫРАЗИТЬ(СчетНаОплату.Содержание КАК СТРОКА(1000)) = """"
		|			ТОГДА ВЫРАЗИТЬ(СчетНаОплату.Номенклатура.НаименованиеПолное КАК СТРОКА(1000))
		|		ИНАЧЕ СчетНаОплату.Содержание
		|	КОНЕЦ КАК Товар,
		|	СчетНаОплату.Номенклатура.Код КАК Код,
		|	СчетНаОплату.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	СчетНаОплату.Количество,
		|	СчетНаОплату.Цена,
		|	СчетНаОплату.Сумма,
		|	СчетНаОплату.СуммаНДС,
		|	СчетНаОплату.СтавкаНДС,
		|	СчетНаОплату.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	Документ.уатСчетНаОплатуПокупателю." + ?(ТекущийДокумент.СверткаУслугРегл, "УслугиРегл", "Услуги") + " КАК СчетНаОплату
		|ГДЕ
		|	СчетНаОплату.Ссылка = &ТекущийДокумент
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		ЗапросТовары = Запрос.Выполнить().Выгрузить();
		
		// Выводим шапку накладной
		
		СведенияОПоставщике = уатОбщегоНазначенияСервер.СведенияОЮрФизЛице(Шапка.Поставщик, Шапка.Дата);
		Если Тип = "Счет" Тогда
			
			ОбластьМакета = Макет.ПолучитьОбласть("Предупреждение");
			ТабличныйДокумент.Вывести(ОбластьМакета);
			
			Банк       = ?(ЗначениеЗаполнено(ТекущийДокумент.СтруктурнаяЕдиница.БанкДляРасчетов), ТекущийДокумент.СтруктурнаяЕдиница.БанкДляРасчетов,
			ТекущийДокумент.СтруктурнаяЕдиница.Банк);
			БИК        = Банк.Код;
			КоррСчет   = Банк.КоррСчет;
			ГородБанка = Банк.Город;
			НомерСчета = ?(ЗначениеЗаполнено(ТекущийДокумент.СтруктурнаяЕдиница.БанкДляРасчетов),ТекущийДокумент.СтруктурнаяЕдиница.Банк.КоррСчет,
			ТекущийДокумент.СтруктурнаяЕдиница.НомерСчета);
			
			ПредставлениеПолучателя = уатОбщегоНазначенияТиповыеСервер.ОписаниеОрганизации(
			уатОбщегоНазначенияСервер.СведенияОЮрФизЛице(Шапка.Получатель, Шапка.Дата),
			"НаименованиеДляПечатныхФорм");
					
			ДвоичныеДанныеQRКода = Неопределено;
			
			ПечатьQRВозможна = ТекущийДокумент.ВариантПечатиQRКода <> Перечисления.уатВариантыПечатиQRКода.НеПечатать
			И ТекущийДокумент.ВариантПечатиQRКода <> Перечисления.уатВариантыПечатиQRКода.ПустаяСсылка();
			Если Не ТекущийДокумент.СтруктурнаяЕдиница.Валютный Тогда
				Если Не ПечатьQRВозможна Тогда
					ДвоичныеДанныеQRКода = Неопределено;
				ИначеЕсли ТекущийДокумент.ВариантПечатиQRКода = Перечисления.уатВариантыПечатиQRКода.ПлатежныеРеквизиты Тогда  
					ДанныеПечатиЗаголовокСчета = Новый Структура;
					ДанныеПечатиЗаголовокСчета.Вставить("БИКБанкаПолучателя", БИК);
					ДанныеПечатиЗаголовокСчета.Вставить("БанкПолучателя", Банк);
					ДанныеПечатиЗаголовокСчета.Вставить("БанкПолучателяПредставление", СокрЛП(Банк) + " " + ГородБанка);
					ДанныеПечатиЗаголовокСчета.Вставить("СчетБанкаПолучателя", КоррСчет);
					ДанныеПечатиЗаголовокСчета.Вставить("СчетБанкаПолучателяПредставление", КоррСчет);
					ДанныеПечатиЗаголовокСчета.Вставить("СчетПолучателяПредставление", НомерСчета);
					ДанныеПечатиЗаголовокСчета.Вставить("СчетПолучателя", НомерСчета);
					ДанныеПечатиЗаголовокСчета.Вставить("ПредставлениеПоставщика", ТекущийДокумент.СтруктурнаяЕдиница.ТекстКорреспондента);
					ДанныеПечатиЗаголовокСчета.Вставить("ПредставлениеПолучателя", ПредставлениеПолучателя);
					ДанныеПечатиЗаголовокСчета.Вставить("ИННПолучателя", Шапка.Получатель.ИНН);
					ДанныеПечатиЗаголовокСчета.Вставить("КПППолучателя", 
						уатОбщегоНазначенияСервер.ПолучитьАктуальныйКПП("Контрагенты", Шапка.Дата, Шапка.Получатель));
					
					ДанныеПечатиИтоговНДС = НовыйДанныеПечатиИтоговНДС();
					
					СтавкиНДС = ОбщегоНазначения.ВыгрузитьКолонку(ТекущийДокумент.Услуги.Выгрузить(), "СтавкаНДС", Истина);
					СуммаНДС    = ТекущийДокумент.Услуги.Итог("СуммаНДС");
					ЗаполнитьЗначенияСвойств(ДанныеПечатиИтоговНДС, 
					ДанныеПечатиИтоговНДС(СуммаНДС, СтавкиНДС, ТекущийДокумент.СуммаВключаетНДС, ":"));

					ДвоичныеДанныеQRКода = QRКодРеквизитыПлатежа(ТекущийДокумент, ДанныеПечатиЗаголовокСчета, ДанныеПечатиИтоговНДС);
				КонецЕсли;
			КонецЕсли;
			
			ЕстьQR = ЗначениеЗаполнено(ДвоичныеДанныеQRКода);

			ОбластьМакета = ?(Факсимиле, 
				?(ЕстьQR, Макет.ПолучитьОбласть("ЗаголовокСчетаСЛоготипомСQR"), Макет.ПолучитьОбласть("ЗаголовокСчетаСЛоготипом")),
				?(ЕстьQR, Макет.ПолучитьОбласть("ЗаголовокСчетаСQR"), Макет.ПолучитьОбласть("ЗаголовокСчета")));
			Если Факсимиле Тогда
				Если ЕстьQR Тогда
					ПодписиИФаксимиле = Новый Соответствие; // Ключ - имя каринки в области, Значение - имя реквизита
					ПодписиИФаксимиле.Вставить("Логотип", "ФайлЛоготип");  
				Иначе
					ПодписиИФаксимиле = Новый Соответствие; // Ключ - имя каринки в области, Значение - имя реквизита
					ПодписиИФаксимиле.Вставить("Логотип1", "ФайлЛоготип");  
				КонецЕсли;
				уатОбщегоНазначения.ЗаполнитьФаксимилеВОбластиМакета(ОбластьМакета, Шапка.Организация, ПодписиИФаксимиле, Ошибки);
			КонецЕсли;
			
			ОбластьМакета.Параметры.Заполнить(Шапка);
			ОбластьМакета.Параметры.ИНН = СведенияОПоставщике.ИНН;
			ОбластьМакета.Параметры.КПП = СведенияОПоставщике.КПП;
			Если ЗначениеЗаполнено(ТекущийДокумент.СтруктурнаяЕдиница) Тогда

				ОбластьМакета.Параметры.БИКБанкаПолучателя               = БИК;
				ОбластьМакета.Параметры.БанкПолучателя                   = Банк;
				ОбластьМакета.Параметры.БанкПолучателяПредставление      = СокрЛП(Банк) + " " + ГородБанка;
				ОбластьМакета.Параметры.СчетБанкаПолучателя              = КоррСчет;
				ОбластьМакета.Параметры.СчетБанкаПолучателяПредставление = КоррСчет;
				ОбластьМакета.Параметры.СчетПолучателяПредставление      = НомерСчета;
				ОбластьМакета.Параметры.СчетПолучателя                   = НомерСчета;
				ОбластьМакета.Параметры.ПредставлениеПоставщика          = ТекущийДокумент.СтруктурнаяЕдиница.ТекстКорреспондента;
				
			КонецЕсли;
			Если уатОбщегоНазначения.уатЗначениеНеЗаполнено(ОбластьМакета.Параметры.ПредставлениеПоставщика) Тогда
				ОбластьМакета.Параметры.ПредставлениеПоставщика = уатОбщегоНазначенияТиповыеСервер.ОписаниеОрганизации(
					СведенияОПоставщике, "НаименованиеДляПечатныхФорм,");
			КонецЕсли;
							
			// Если макет поддерживает QR код
			Если Макет.Области.Найти("QRКод") <> Неопределено
				И ЕстьQR Тогда
				ЗаполнитьЗначенияСвойств(ОбластьМакета.Параметры, ОбластьМакета.Параметры);
				Если Факсимиле Тогда
					ЗаполнитьЗначенияСвойств(ОбластьМакета.Рисунки, ОбластьМакета.Рисунки);
					Если ЕстьQR Тогда
						ОбластьМакета.Рисунки.Логотип.Картинка = ОбластьМакета.Рисунки.Логотип.Картинка;
					Иначе
						ОбластьМакета.Рисунки.Логотип1.Картинка = ОбластьМакета.Рисунки.Логотип1.Картинка;
					КонецЕсли;
				КонецЕсли;
				ОбластьРисунка = ?(Факсимиле, ОбластьМакета.Области.Найти("РисунокQR1"), ОбластьМакета.Области.Найти("РисунокQR"));
				Если ЕстьQR
					И ОбластьРисунка <> Неопределено Тогда
					ОбластьРисунка.Картинка = Новый Картинка(ДвоичныеДанныеQRКода);
				КонецЕсли;
				ТабличныйДокумент.Вывести(ОбластьМакета);
			Иначе
				 ТабличныйДокумент.Вывести(ОбластьМакета);
			КонецЕсли;
			
		КонецЕсли; 
		
		ОбластьМакета = ?(Факсимиле, Макет.ПолучитьОбласть("ЗаголовокСчетаСЛоготипом"), Макет.ПолучитьОбласть("Заголовок"));

		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ОбластьМакета.Параметры.ТекстЗаголовка = уатОбщегоНазначенияТиповые.уатСформироватьЗаголовокДокумента(Шапка,
			НСтр("en='Invoice';ru='Счет на оплату'"));
		
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ОбластьМакета.Параметры.ПредставлениеПоставщика = уатОбщегоНазначенияТиповыеСервер.ОписаниеОрганизации(
			уатОбщегоНазначенияСервер.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата),
			"НаименованиеДляПечатныхФорм,ИНН,КПП,ЮридическийАдрес,Телефоны,");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		СведенияОПолучателе = уатОбщегоНазначенияСервер.СведенияОЮрФизЛице(Шапка.Получатель, Шапка.Дата);
		ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ОбластьМакета.Параметры.ПредставлениеПолучателя = уатОбщегоНазначенияТиповыеСервер.ОписаниеОрганизации(
			уатОбщегоНазначенияСервер.СведенияОЮрФизЛице(Шапка.Получатель, Шапка.Дата),
			"НаименованиеДляПечатныхФорм,ИНН,КПП,ЮридическийАдрес,Телефоны,");
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		ОбластьОснование = Макет.ПолучитьОбласть("Основание");
		ОбластьОснование.Параметры.Основание = ТекущийДокумент.ДоговорКонтрагента;
		ТабличныйДокумент.Вывести(ОбластьОснование);
		
		ОбластьНомера = Макет.ПолучитьОбласть("ШапкаТаблицы|НомерСтроки");
		ОбластьДанных = Макет.ПолучитьОбласть("ШапкаТаблицы|Данные");
		ОбластьСуммы  = Макет.ПолучитьОбласть("ШапкаТаблицы|Сумма");
		
		ТабличныйДокумент.Вывести(ОбластьНомера);
		
		ТабличныйДокумент.Присоединить(ОбластьДанных);
		ТабличныйДокумент.Присоединить(ОбластьСуммы);
		
		ОбластьКолонкаТовар = Макет.Область("Товар");
		
		ОбластьНомера = Макет.ПолучитьОбласть("Строка|НомерСтроки");
		ОбластьДанных = Макет.ПолучитьОбласть("Строка|Данные");
		ОбластьСуммы  = Макет.ПолучитьОбласть("Строка|Сумма");
		
		Сумма    = 0;
		СуммаНДС = 0;
		СтавкиНДС = ОбщегоНазначения.ВыгрузитьКолонку(ЗапросТовары, "СтавкаНДС", Истина);
		
		Для каждого ВыборкаСтрокТовары Из ЗапросТовары Цикл 
			
			Если уатОбщегоНазначения.уатЗначениеНеЗаполнено(ВыборкаСтрокТовары.Номенклатура) Тогда
				ТекстНСТР = НСтр("en='In one of the rows value of products and services not filled - string when printing is missing.';ru='В одной из строк не заполнено значение номенклатуры - строка при печати пропущена.'");
				уатОбщегоНазначенияТиповые.СообщитьОбОшибке(ТекстНСТР, , , СтатусСообщения.Важное);
				Продолжить;
			КонецЕсли;
			
			ОбластьНомера.Параметры.НомерСтроки = ЗапросТовары.Индекс(ВыборкаСтрокТовары) + 1;
			ТабличныйДокумент.Вывести(ОбластьНомера);
			
			
			ОбластьДанных.Параметры.Заполнить(ВыборкаСтрокТовары);
			КоличествоОкр = Окр(ВыборкаСтрокТовары.Количество,3);
			ОбластьДанных.Параметры.Количество = КоличествоОкр;
			ОбластьДанных.Параметры.Товар = СокрП(уатОбщегоНазначенияСервер.ПолучитьНаименованиеУслугиДляПечати(ВыборкаСтрокТовары.Номенклатура,ВыборкаСтрокТовары.Товар));
			ТабличныйДокумент.Присоединить(ОбластьДанных);
			
			ОбластьСуммы.Параметры.Заполнить(ВыборкаСтрокТовары);
			ТабличныйДокумент.Присоединить(ОбластьСуммы);
			Сумма          = Сумма       + ВыборкаСтрокТовары.Сумма;
			СуммаНДС       = СуммаНДС    + ВыборкаСтрокТовары.СуммаНДС;
			
		КонецЦикла;
		
		// Вывести Итого
		ОбластьНомера = Макет.ПолучитьОбласть("Итого|НомерСтроки");
		ОбластьДанных = Макет.ПолучитьОбласть("Итого|Данные");
		ОбластьСуммы  = Макет.ПолучитьОбласть("Итого|Сумма");
		
		ТабличныйДокумент.Вывести(ОбластьНомера);
		
		ТабличныйДокумент.Присоединить(ОбластьДанных);
		ОбластьСуммы.Параметры.Всего = уатОбщегоНазначенияТиповые.уатФорматСумм(Сумма);
		ТабличныйДокумент.Присоединить(ОбластьСуммы);
		
		// Вывести ИтогоНДС
		Если Шапка.УчитыватьНДС Тогда
			ОбластьНомера = Макет.ПолучитьОбласть("ИтогоНДС|НомерСтроки");
			ОбластьДанных = Макет.ПолучитьОбласть("ИтогоНДС|Данные");
			ОбластьСуммы  = Макет.ПолучитьОбласть("ИтогоНДС|Сумма");
			
			ТабличныйДокумент.Вывести(ОбластьНомера);
			
			Если СуммаНДС <> 0 Тогда
				ДанныеПечатиНДС = уатОбщегоНазначенияТиповые.уатДанныеПечатиИтоговНДС(СуммаНДС, СтавкиНДС, Шапка.СуммаВключаетНДС, ":");
				ОбластьДанных.Параметры.НДС = ДанныеПечатиНДС.НДС;
				ОбластьСуммы.Параметры.ВсегоНДС = ДанныеПечатиНДС.ВсегоНДС;
			Иначе
				ДанныеПечатиНДС = уатОбщегоНазначенияТиповые.уатДанныеПечатиИтоговНДС(0, СтавкиНДС, Шапка.СуммаВключаетНДС, ":"); 
				ОбластьДанных.Параметры.НДС = ДанныеПечатиНДС.НДС;
				ОбластьСуммы.Параметры.ВсегоНДС = ДанныеПечатиНДС.ВсегоНДС;
			КонецЕсли;	
			
			ТабличныйДокумент.Присоединить(ОбластьДанных);
			ТабличныйДокумент.Присоединить(ОбластьСуммы);
		КонецЕсли;
		
		// Вывести ИтогоНП
		ОбластьНомера = Макет.ПолучитьОбласть("ИтогоНП|НомерСтроки");
		ОбластьДанных = Макет.ПолучитьОбласть("ИтогоНП|Данные");
		ОбластьСуммы  = Макет.ПолучитьОбласть("ИтогоНП|Сумма");
		ОбластьДанных.Параметры.НП = НСтр("ru = 'Всего к оплате:'; en = 'Total to be paid:'");
		СуммаКОплате = Сумма + ?(Шапка.СуммаВключаетНДС И Шапка.УчитыватьНДС, 0, СуммаНДС);
		ОбластьСуммы.Параметры.ВсегоНП = уатОбщегоНазначенияТиповые.уатФорматСумм(СуммаКОплате);
		
		ТабличныйДокумент.Вывести(ОбластьНомера);
		ТабличныйДокумент.Присоединить(ОбластьДанных);
		ТабличныйДокумент.Присоединить(ОбластьСуммы);
		
		// Вывести Сумму прописью
		ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописью");
		СуммаКПрописи = Сумма + ?(Шапка.УчитыватьНДС И НЕ Шапка.СуммаВключаетНДС, СуммаНДС, 0);
		ОбластьМакета.Параметры.ИтоговаяСтрока ="Всего наименований " + ЗапросТовары.Количество()
		+ ", на сумму " + уатОбщегоНазначенияТиповые.уатФорматСумм(СуммаКПрописи, Шапка.ВалютаДокумента);
		ОбластьМакета.Параметры.СуммаПрописью = уатОбщегоНазначенияТиповые.уатСформироватьСуммуПрописью(
			СуммаКПрописи, Шапка.ВалютаДокумента);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		// Вывести подписи
		Если Тип = "Счет" Тогда
			ОбластьМакета = ?(Факсимиле, Макет.ПолучитьОбласть("ПодвалСчетаФаксимиле"), Макет.ПолучитьОбласть("ПодвалСчета"));
			
			ОбластьМакета.Параметры.ФИООтветственный = "/" + ТекущийДокумент.Ответственный + "/";
			
			Руководители = уатОбщегоНазначенияТиповые.уатОтветственныеЛицаОрганизаций(Шапка.Руководители, Шапка.Дата,);
			Если Руководители <> Неопределено Тогда
				ОбластьМакета.Параметры.ФИОРуководителя  = "/" + Руководители.Руководитель  + "/";
				ОбластьМакета.Параметры.ФИОБухгалтера    = "/" + Руководители.ГлавныйБухгалтер     + "/";
			КонецЕсли;
			
			Если Факсимиле Тогда
				ПодписиИФаксимиле = Новый Соответствие; // Ключ - имя каринки в области, Значение - имя реквизита
				ПодписиИФаксимиле.Вставить("ПодписьРуководителя", ?(Руководители <> Неопределено, Руководители.РуководительСсылка, Справочники.ФизическиеЛица.ПустаяСсылка()));
				ПодписиИФаксимиле.Вставить("ПечатьОрганизации", "ФайлФаксимильнаяПечать");
				ПодписиИФаксимиле.Вставить("ПодписьБухгалтера", ?(Руководители <> Неопределено, Руководители.ГлавныйБухгалтерСсылка, Справочники.ФизическиеЛица.ПустаяСсылка()));
				ПодписиИФаксимиле.Вставить("ПодписьМенеджера", ТекущийДокумент.Ответственный);
				уатОбщегоНазначения.ЗаполнитьФаксимилеВОбластиМакета(ОбластьМакета, Шапка.Организация, ПодписиИФаксимиле, Ошибки);
			Конецесли;

		Иначе
			ОбластьМакета = Макет.ПолучитьОбласть("ПодвалЗаказа");
		КонецЕсли; 
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ТабличныйДокумент.Вывести(ОбластьМакета);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ТекущийДокумент);
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;
	
КонецФункции // ПечатнаяФорма()

// Процедура формирования предварительной печатной формы документа (образец)
//
// Вызывается из карточки "Организации" для просмотра размещения логотипов
//
Функция ПечатьПредварительныйПросмотрСчетаНаОплату(Организация, ОбъектыПечати, ИмяМакета) Экспорт
	
	Перем Ошибки;
	
	ЭтоОрганизация    = ТипЗнч(Организация) = Тип("СправочникСсылка.Организации");
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ЗначениеДаты = ТекущаяДата();
	НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
	ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_" + ИмяМакета + "_" + ИмяМакета;
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.уатСчетНаОплатуПокупателю.ПФ_MXL_СчетНаОплатуПокупателю");
	
	ОбластьМакета = Макет.ПолучитьОбласть("ЗаголовокСчетаСЛоготипом");
	Если ЭтоОрганизация Тогда
		ПодписиИФаксимиле = Новый Соответствие; // Ключ - имя каринки в области, Значение - имя реквизита
		ПодписиИФаксимиле.Вставить("Логотип1", "ФайлЛоготип");
		уатОбщегоНазначения.ЗаполнитьФаксимилеВОбластиМакета(ОбластьМакета, Организация, ПодписиИФаксимиле, Ошибки);
	КонецЕсли;
	ТабличныйДокумент.Вывести(ОбластьМакета);
		
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.ТекстЗаголовка = Нстр("ru = 'Счет на оплату № -000001 от'; en = 'Invoice No. -000001 dated'")  + " " + Формат(ЗначениеДаты, "ДФ='дд ММММ гггг'");
	ТабличныйДокумент.Вывести(ОбластьМакета);

	ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
	ТабличныйДокумент.Вывести(ОбластьМакета);

	ОбластьМакета = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Строка");
	ДанныеПечатиСтрока = Новый Структура;
	ДанныеПечатиСтрока.Вставить("НомерСтроки", 1);
	ДанныеПечатиСтрока.Вставить("Товар", "Товар");
	ДанныеПечатиСтрока.Вставить("ЕдиницаИзмерения", "шт");
	ДанныеПечатиСтрока.Вставить("Цена", 120);
	ДанныеПечатиСтрока.Вставить("Количество", 10);
	ДанныеПечатиСтрока.Вставить("Сумма", 1200);
	
	ОбластьМакета.Параметры.Заполнить(ДанныеПечатиСтрока);

	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("Итого");
	ОбластьМакета.Параметры.Всего = уатОбщегоНазначенияТиповые.уатФорматСумм(1200);
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("ИтогоНДС");
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("ИтогоНП");
	ОбластьМакета.Параметры.НП = НСтр("ru = 'Всего к оплате:'; en = 'Total to be paid:'");
	ОбластьМакета.Параметры.ВсегоНП = уатОбщегоНазначенияТиповые.уатФорматСумм(1200);
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ОбластьМакета = Макет.ПолучитьОбласть("СуммаПрописью");
	СуммаКПрописи = 1200;
	ОбластьМакета.Параметры.ИтоговаяСтрока ="Всего наименований 1, на сумму "
	+ уатОбщегоНазначенияТиповые.уатФорматСумм(СуммаКПрописи);
	ОбластьМакета.Параметры.СуммаПрописью = уатОбщегоНазначенияТиповые.уатСформироватьСуммуПрописью(
	СуммаКПрописи, Новый Структура("ПараметрыПрописи", ""));
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	Руководители = уатОбщегоНазначенияТиповые.уатОтветственныеЛицаОрганизаций(Организация, ЗначениеДаты);
	
	Если ЭтоОрганизация Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("ПодвалСчетаФаксимиле");
		ПодписиИФаксимиле = Новый Соответствие; // Ключ - имя каринки в области, Значение - имя реквизита
		ПодписиИФаксимиле.Вставить("ПодписьРуководителя", ?(Руководители <> Неопределено, Руководители.РуководительСсылка, Справочники.ФизическиеЛица.ПустаяСсылка()));
		ПодписиИФаксимиле.Вставить("ПечатьОрганизации", "ФайлФаксимильнаяПечать");
		ПодписиИФаксимиле.Вставить("ПодписьМенеджера", ?(Руководители <> Неопределено, Руководители.ГлавныйБухгалтерСсылка, Справочники.ФизическиеЛица.ПустаяСсылка()));
		ПодписиИФаксимиле.Вставить("ПодписьБухгалтера", ?(Руководители <> Неопределено, Руководители.ГлавныйБухгалтерСсылка, Справочники.ФизическиеЛица.ПустаяСсылка()));
		уатОбщегоНазначения.ЗаполнитьФаксимилеВОбластиМакета(ОбластьМакета, Организация, ПодписиИФаксимиле, Ошибки);
	Иначе
		ОбластьМакета = Макет.ПолучитьОбласть("ПодвалСчетаФаксимиле");
		ПодписиИФаксимиле = Новый Соответствие; // Ключ - имя каринки в области, Значение - имя реквизита
		ПодписиИФаксимиле.Вставить("ПодписьРуководителя", Организация);
		ПодписиИФаксимиле.Вставить("ПодписьБухгалтера",   Организация);
		ПодписиИФаксимиле.Вставить("ПодписьМенеджера",    Организация);
		ПодписиИФаксимиле.Вставить("ПечатьОрганизации",   "ФайлФаксимильнаяПечать");
		уатОбщегоНазначения.ЗаполнитьФаксимилеВОбластиМакета(ОбластьМакета, Организация, ПодписиИФаксимиле, Ошибки);
	КонецЕсли;
	
	ТабличныйДокумент.Вывести(ОбластьМакета);
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	Возврат ТабличныйДокумент;
	
КонецФункции

// Процедура - Заполнить структуру получателей печатных форм
//
// Параметры:
//  СтруктураДанныхОбъектаПечати - Структура - Структура данных получателей печатной формы
//
Процедура ЗаполнитьСтруктуруПолучателейПечатныхФорм(СтруктураДанныхОбъектаПечати) Экспорт
	
	СтруктураДанныхОбъектаПечати.ОсновнойПолучатель = "Контрагент";
	 
	СтруктураДанныхОбъектаПечати.МассивРеквизитовПолучателей.Добавить("Контрагент");
	СтруктураДанныхОбъектаПечати.МассивРеквизитовПолучателей.Добавить("КонтактноеЛицо");
	СтруктураДанныхОбъектаПечати.МассивРеквизитовПолучателей.Добавить("Грузоотправитель");
	СтруктураДанныхОбъектаПечати.МассивРеквизитовПолучателей.Добавить("Грузополучатель");
	
КонецПроцедуры

Функция QRКодРеквизитыПлатежа(ДанныеДокумента, ДанныеПечатиЗаголовокСчета, ДанныеПечатиИтоговНДС)
	РеквизитыПлатежа = НовыйРеквизитыПлатежаУФЭБС();
	
	ЗаполнитьЗначенияСвойств(РеквизитыПлатежа, ДанныеПечатиЗаголовокСчета);
	
	РеквизитыПлатежа.ТекстПолучателя             = ДанныеПечатиЗаголовокСчета.ПредставлениеПолучателя;
	РеквизитыПлатежа.НомерСчетаПолучателя        = ДанныеПечатиЗаголовокСчета.СчетПолучателя;
	РеквизитыПлатежа.НаименованиеБанкаПолучателя = ДанныеПечатиЗаголовокСчета.БанкПолучателяПредставление;
	РеквизитыПлатежа.БИКБанкаПолучателя          = ДанныеПечатиЗаголовокСчета.БИКБанкаПолучателя;
	РеквизитыПлатежа.СчетБанкаПолучателя         = ДанныеПечатиЗаголовокСчета.СчетБанкаПолучателя;
	
	РеквизитыПлатежа.ИННПолучателя               = ДанныеПечатиЗаголовокСчета.ИННПолучателя;
	РеквизитыПлатежа.КПППолучателя               = ДанныеПечатиЗаголовокСчета.КПППолучателя;
	
	СуммаКОплате = ДанныеДокумента.Услуги.Итог("Сумма");
	Если НЕ ДанныеДокумента.СуммаВключаетНДС Тогда
		СуммаКОплате = СуммаКОплате + ДанныеДокумента.Услуги.Итог("СуммаНДС");
	КонецЕсли; 
	
	РеквизитыПлатежа.СуммаЧислом = СуммаКОплате;
	
	ТекстПроНДС = ДанныеПечатиИтоговНДС.НДС;
	Если ДанныеПечатиИтоговНДС.ВсегоНДС <> "-" Тогда
		ТекстПроНДС = ТекстПроНДС + ДанныеПечатиИтоговНДС.ВсегоНДС;
	КонецЕсли;
	
	РеквизитыПлатежа.НазначениеПлатежа = СтрШаблон(НСтр("ru = 'Оплата по счету № %1 от %2. Сумма %3. %4.'; en = 'Payment on account No. %1 from %2. Amount %3. %4.'"),
		ДанныеДокумента.Номер,
		Формат(ДанныеДокумента.Дата, "ДФ=dd.MM.yyyy"),
		Формат(СуммаКОплате, "ЧЦ=15; ЧДЦ=2; ЧРД=-; ЧН=0-00; ЧГ="),
		ТекстПроНДС);
	
	// QR-код
	QRСтрока = УправлениеПечатьюРФ.ФорматнаяСтрокаУФЭБС(РеквизитыПлатежа);
	Если ПустаяСтрока(QRСтрока) Тогда
		Возврат Неопределено; // Возникли ошибки
	КонецЕсли;
	
	ДанныеQRКода = ГенерацияШтрихкода.ДанныеQRКода(QRСтрока, 0, 190);
	Если НЕ ТипЗнч(ДанныеQRКода) = Тип("ДвоичныеДанные") Тогда
		Шаблон = Нстр("ru = 'Не удалось сформировать QR-код для документа %1."
"Технические подробности см. в журнале регистрации.'; en = 'Failed to generate a QR code for document %1."
"For technical details, see the registration log.'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон, ДанныеДокумента.Документ);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ДанныеQRКода;
	
КонецФункции

Функция НовыйДанныеПечатиИтоговНДС()
	ДанныеПечатиИтоговНДС = Новый Структура;
	
	ДанныеПечатиИтоговНДС.Вставить("НДС",      "");
	ДанныеПечатиИтоговНДС.Вставить("ВсегоНДС", "");
	
	Возврат ДанныеПечатиИтоговНДС;
КонецФункции

Функция ДанныеПечатиИтоговНДС(СуммаНДС, СтавкиНДС, СуммаВключаетНДС, Разделитель = "")
	ДанныеПечатиИтогоНДС = НовыйДанныеПечатиИтоговНДС();
	
	Если СуммаНДС <> 0 Тогда
		Если СуммаВключаетНДС Тогда
			СтрокаШаблона = НСтр("ru = 'В том числе НДС%1%2'; en = 'Including VAT%1%2'")
		Иначе
			СтрокаШаблона = НСтр("ru = 'Сумма НДС%1%2'; en = 'VAT amount%1%2'");
		КонецЕсли; 
		
		Если СтавкиНДС.Количество() = 1 Тогда
			СтавкаНДССтрокой = СтрШаблон(" %1%%",уатОбщегоНазначенияТиповые.уатПолучитьСтавкуНДС(СтавкиНДС[0]));
			
			ДанныеПечатиИтогоНДС.НДС = СтрШаблон(СтрокаШаблона,СтавкаНДССтрокой, Разделитель);
		Иначе
			ДанныеПечатиИтогоНДС.НДС = СтрШаблон(СтрокаШаблона, "", Разделитель);
		КонецЕсли; 
		
		ДанныеПечатиИтогоНДС.ВсегоНДС = уатОбщегоНазначенияТиповые.уатФорматСумм(СуммаНДС);
	Иначе
		Если СтавкиНДС.Найти(Перечисления.СтавкиНДС.НДС0) <> Неопределено Тогда
			ДанныеПечатиИтогоНДС.НДС      = НСтр("ru = 'НДС 0%'; en = 'VAT 0%'");
		Иначе
			ДанныеПечатиИтогоНДС.НДС      = НСтр("ru = 'Без налога (НДС)'; en = 'Without tax (VAT)'");
		КонецЕсли; 
		ДанныеПечатиИтогоНДС.ВсегоНДС = НСтр("ru = '-'; en = '-'");
	КонецЕсли;
	
	Возврат ДанныеПечатиИтогоНДС;
КонецФункции

Функция НовыйРеквизитыПлатежаУФЭБС()
	
	// Входящие данные функци УправлениеПечатьюРФ.ФорматнаяСтрокаУФЭБС()
	
	Возврат Новый Структура(
		// Обязательные поля структуры
		"ТекстПолучателя,
		|НомерСчетаПолучателя,
		|НаименованиеБанкаПолучателя,
		|БИКБанкаПолучателя,
		|СчетБанкаПолучателя,
		|ИндексПлатежногоДокумента,
		// Дополнительные поля структуры
		|СуммаЧислом,
		|НазначениеПлатежа,
		|ИННПолучателя,
		|ИННПлательщика,
		|СтатусСоставителя,
		|КПППолучателя,
		|КодБК,
		|КодОКТМО,
		|ПоказательОснования,
		|ПоказательПериода,
		|ПоказательНомера,
		|ПоказательДаты,
		|ПоказательТипа,
		// Прочие дополнительные поля
		|ФамилияПлательщика,
		|ИмяПлательщика,
		|ОтчествоПлательщика,
		|АдресПлательщика,
		|ИдентификаторНачисления,
		|Ссылка");
	
КонецФункции

#КонецОбласти

#КонецЕсли
